posts/looking-glass.org
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}
#+OPTIONS: toc:nil

#+HUGO_BASE_DIR: /home/shane/var/smulliga/source/git/semiosis/semiosis-hugo
#+HUGO_SECTION: ./

#+TITLE: LookingGlass 🔍 (a browser for the imaginary web)
#+DATE: <2021-10-15>
#+AUTHOR: Shane Mulligan
#+KEYWORDS: emacs imaginary-internet imaginary 𝑖web

** Introducing _LookingGlass_

+ Source code :: http://github.com/semiosis/pen.el/blob/master/src/pen-looking-glass.el

=LookingGlass= is an imaginary-web (𝑖web)
browser. It allows lets you visit websites that do
not exist concretely, and also also allows you
to treat any text as having hyperlinks.

An imaginary-web browser requires a LM such as
GPT-3, Codex or GPT-j to generate websites and
is designed to provide the means to surf the
imagination of the AI through the guise of a
web-browser interface.

It's a very practical tool that [as an example]
lets you create tutorials for topics that have
not had somebody explicitly create tutorials
for, and allows you to infer what might be
behind the 404, if you come across a website
which has been taken down.

** How to browse
- https://mullikine.github.io/posts/the-imaginary-web-with-codex/

** How to search
- https://mullikine.github.io/posts/search-the-web-with-codex/