content/looking-glass.md
+++
title = "LookingGlass 🔍 (a browser for the imaginary web)"
author = ["Shane Mulligan"]
date = 2021-10-15T00:00:00+13:00
keywords = ["emacs", "imaginary-internet", "imaginary", "𝑖web"]
draft = false
+++

## Introducing <span class="underline">LookingGlass</span> {#introducing}

Source code
: <http://github.com/semiosis/pen.el/blob/master/src/pen-looking-glass.el>

`LookingGlass` is an imaginary-web (𝑖web)
browser. It allows lets you visit websites that do
not exist concretely, and also also allows you
to treat any text as having hyperlinks.

An imaginary-web browser requires a LM such as
GPT-3, Codex or GPT-j to generate websites and
is designed to provide the means to surf the
imagination of the AI through the guise of a
web-browser interface.

It's a very practical tool that [as an example]
lets you create tutorials for topics that have
not had somebody explicitly create tutorials
for, and allows you to infer what might be
behind the 404, if you come across a website
which has been taken down.


## How to browse {#how-to-browse}

-   <https://mullikine.github.io/posts/the-imaginary-web-with-codex/>


## How to search {#how-to-search}

-   <https://mullikine.github.io/posts/search-the-web-with-codex/>